app/views/blogs/_blog.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 7]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."blog_id" = $1  [["blog_id", 8]]
---
    <p class="card-post">
      <%= render partial: "shared/comment_total", locals: {comment_total:blog.comments.size} %>,
      <%= render partial: "shared/like_total", locals: {like_total:blog.likes.size} %>