app/views/blogs/index.html.erb

    <div class="card-img">
    <%= image_tag (@user.photo,( alt: 'Image'), class: 'img' %>
    </div>
    <div class="card-body">
      <h2  class="card-title"><%= @user.name %></h2>
      <p class="card-post">Posts: <%= @user.postsCounter %></p>
    </div>
  </div>

  <% @blogs.each do |blog|%>
   <div class="card-body">
   <h1 class="card-title"> <%= blog.title %></h1>
   <p class="card-content"><%= blog.text %></p>
    <em class="card-post">
    Comments: <%= blog.comments.size %>, Likes: <%= blog.likes.size %>
    <em>
   </div>
    <div class="recent-comments"><% blog.recent_comment%></div>
  <% end %>

  <div>
  </div>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."blog_id" = $1  [["blog_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" IN ($1, $2)  [["blog_id", 1], ["blog_id", 3]]