app/views/blogs/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."blog_id" = $1  [["blog_id", 2]]
---
  <div>
    <%= render partial: "shared/comment_total", locals: { comment_total: @blog.comments.size } %>,
    <%= render partial: "shared/like_total", locals: {like_total: @blog.likes.size} %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 2]]
---
    <h4>Comments</h4>
      <% if @blog.comments.size > 0 %>