app/views/shared/_like_shared.html.erb

SELECT 1 AS one FROM "likes" WHERE "likes"."blog_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["blog_id", 1], ["user_id", 2], ["LIMIT", 1]]
---
  <div>
  <% if blog.likes.exists?(user_id: @current_user) %>