app/controllers/api_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def list_posts
    render json: Blog.all

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 1]]
---
  def list_comments
    render json: Comment.where(blog_id: params[:blog_id])