app/controllers/blogs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" IN ($1, $2)  [["blog_id", 1], ["blog_id", 3]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @blogs = @user.blogs.includes(:comments)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1 AND "blogs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 7]]
---
  def show
    @user = User.find(params[:id])
    @blog = @user.blogs.find(params[:user_id])
    @comments = @blog.comments.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 2]]
---
  def destroy
    @user = User.find(params[:user_id])
    @blog = Blog.find_by_id(params[:blog_id])
    if @blog.destroy