app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "user_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Testing add comment"], ["user_id", 1], ["blog_id", 7], ["created_at", "2022-03-03 08:19:19.031162"], ["updated_at", "2022-03-03 08:19:19.031162"]]
UPDATE "blogs" SET "updated_at" = $1, "commentsCounter" = $2 WHERE "blogs"."id" = $3  [["updated_at", "2022-03-03 08:19:19.069462"], ["commentsCounter", 1], ["id", 7]]
---
  def create
    blog = Blog.find(params[:id])
    comment = Comment.create(user_id: current_user.id, blog_id: blog.id, text: comment_params[:text])
    if comment.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    @blog = Blog.find_by_id(params[:blog_id])
    @user = User.find_by_id(params[:user_id])