app/controllers/likes_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["blog_id", 7], ["created_at", "2022-03-03 08:16:36.859119"], ["updated_at", "2022-03-03 08:16:36.859119"]]
UPDATE "blogs" SET "updated_at" = $1, "likesCounter" = $2 WHERE "blogs"."id" = $3  [["updated_at", "2022-03-03 08:18:17.479696"], ["likesCounter", 1], ["id", 7]]
---
  def create
    blog = Blog.find(params[:id])
    like = Like.create(user_id: current_user.id, blog_id: blog.id)
    if like.save