app/models/blog.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1  [["user_id", 1]]
---
  def update_post
    user.update(postsCounter: user.blogs.length)