app/models/comment.rb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 7]]
UPDATE "blogs" SET "updated_at" = $1, "commentsCounter" = $2 WHERE "blogs"."id" = $3  [["updated_at", "2022-03-03 08:19:19.069462"], ["commentsCounter", 1], ["id", 7]]
---
  def update_comments
    blog.update(commentsCounter: blog.comments.length)