app/models/like.rb

SELECT "likes".* FROM "likes" WHERE "likes"."blog_id" = $1  [["blog_id", 7]]
UPDATE "blogs" SET "updated_at" = $1, "likesCounter" = $2 WHERE "blogs"."id" = $3  [["updated_at", "2022-03-03 08:18:17.479696"], ["likesCounter", 1], ["id", 7]]
---
  def update_likes
    blog.update(likesCounter: blog.like.length)